In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [2]:
ser1 = Series([1,2,3,4],index = ['A','B','C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

Reindexing allows you to rearrange the data according to a different index. You can also set a value to fill in the new indexes.

In [3]:
ser2 = ser1.reindex(['A','B','C','D','E','F'])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [4]:
ser2.reindex(['A','B','C','D','E','F','G'], fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [6]:
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [7]:
ranger = range(15)
ranger

range(0, 15)

In [8]:
ranger

range(0, 15)

Using forward fill

In [9]:
ser3.reindex(ranger,method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [10]:
dframe = DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['col1','col2','col3','col4','col5'])
dframe

       col1      col2      col3      col4      col5
A -0.200395  0.823330  0.225494  0.134419  2.558474
B  0.288188 -1.250021  0.562154  1.858489  0.923828
D  0.131539  0.938337 -1.495984  1.125172  0.356390
E  0.584467  0.113590 -1.614774 -0.938854 -0.370623
F  0.380219  1.748316 -0.101552 -1.104862 -1.405249

Reindexing to add a row

In [13]:
dframe2 = dframe.reindex(['A','B','C','D','E','F'])

In [14]:
dframe2

       col1      col2      col3      col4      col5
A -0.200395  0.823330  0.225494  0.134419  2.558474
B  0.288188 -1.250021  0.562154  1.858489  0.923828
C       NaN       NaN       NaN       NaN       NaN
D  0.131539  0.938337 -1.495984  1.125172  0.356390
E  0.584467  0.113590 -1.614774 -0.938854 -0.370623
F  0.380219  1.748316 -0.101552 -1.104862 -1.405249

Reindexing to add a column

In [15]:
new_columns = ['col1','col2','col3','col4','col5','col6']

In [16]:
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -0.200395  0.823330  0.225494  0.134419  2.558474   NaN
B  0.288188 -1.250021  0.562154  1.858489  0.923828   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  0.131539  0.938337 -1.495984  1.125172  0.356390   NaN
E  0.584467  0.113590 -1.614774 -0.938854 -0.370623   NaN
F  0.380219  1.748316 -0.101552 -1.104862 -1.405249   NaN

In [17]:
dframe

       col1      col2      col3      col4      col5
A -0.200395  0.823330  0.225494  0.134419  2.558474
B  0.288188 -1.250021  0.562154  1.858489  0.923828
D  0.131539  0.938337 -1.495984  1.125172  0.356390
E  0.584467  0.113590 -1.614774 -0.938854 -0.370623
F  0.380219  1.748316 -0.101552 -1.104862 -1.405249

In [18]:
dframe.ix[['A','B','C','D','E','F'],new_columns]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

       col1      col2      col3      col4      col5  col6
A -0.200395  0.823330  0.225494  0.134419  2.558474   NaN
B  0.288188 -1.250021  0.562154  1.858489  0.923828   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  0.131539  0.938337 -1.495984  1.125172  0.356390   NaN
E  0.584467  0.113590 -1.614774 -0.938854 -0.370623   NaN
F  0.380219  1.748316 -0.101552 -1.104862 -1.405249   NaN